# Fictional Army - Filtering and Sorting

### Import libraries

In [259]:
import numpy as np
import pandas as pd

### Step 1. This is the data given as a dictionary. Create a dataframe and assign it to a variable called army.

In [260]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, None, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, None, 3, None, 2, None, 2, None, None, 1, 2, None],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [261]:
army = pd.DataFrame(raw_data)
army

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523.0,5,1045,1,1.0,1,4,Arizona
1,Nighthawks,1st,52.0,42,957,5,NaN,0,24,California
2,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31,Texas
3,Nighthawks,2nd,616.0,2,1400,26,NaN,1,2,Florida
4,Dragoons,1st,43.0,4,1592,73,2.0,0,3,Maine
5,Dragoons,1st,234.0,7,1006,37,NaN,1,4,Iowa
6,Dragoons,2nd,523.0,8,987,949,2.0,0,24,Alaska
7,Dragoons,2nd,62.0,3,849,48,NaN,1,31,Washington
8,Scouts,1st,NaN,4,973,48,NaN,0,2,Oregon
9,Scouts,1st,73.0,7,1005,435,1.0,0,3,Wyoming
10,Scouts,2nd,37.0,8,1099,63,2.0,1,2,Louisana
11,Scouts,2nd,35.0,9,1523,345,NaN,1,3,Georgia

In [262]:
army.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   regiment   12 non-null     object
 1   company    12 non-null     object
 2   deaths     11 non-null     float64
 3   battles    12 non-null     int64
 4   size       12 non-null     int64
 5   veterans   12 non-null     int64
 6   readiness  6 non-null      float64
 7   armored    12 non-null     int64
 8   deserters  12 non-null     int64
 9   origin     12 non-null     object
dtypes: float64(2), int64(5), object(3)
memory usage: 1.1+ KB

In [263]:
army.describe()

,deaths,battles,size,veterans,readiness,armored,deserters
count,11.000000,12.000000,12.000000,12.000000,6.000000,12.000000,12.000000
mean,202.090909,8.416667,1127.916667,174.333333,1.833333,0.583333,11.083333
std,234.300429,10.849871,240.241719,280.254214,0.752773,0.514929,12.324833
min,25.000000,2.000000,849.000000,1.000000,1.000000,0.000000,2.000000
25%,40.000000,3.750000,983.500000,34.250000,1.250000,0.000000,2.750000
50%,62.000000,6.000000,1025.500000,55.000000,2.000000,1.000000,3.500000
75%,378.500000,8.000000,1174.250000,141.000000,2.000000,1.000000,24.000000
max,616.000000,42.000000,1592.000000,949.000000,3.000000,1.000000,31.000000

### Step 2. Check missing values

In [264]:
army.isnull()

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,True,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,True,False,False,False
6,False,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,True,False,False,False
8,False,False,True,False,False,False,True,False,False,False
9,False,False,False,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False,False,False,False
11,False,False,False,False,False,False,True,False,False,False

In [265]:
army[(army['readiness'].isnull()) | (army['deaths'].isnull())]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
1,Nighthawks,1st,52.0,42,957,5,NaN,0,24,California
3,Nighthawks,2nd,616.0,2,1400,26,NaN,1,2,Florida
5,Dragoons,1st,234.0,7,1006,37,NaN,1,4,Iowa
7,Dragoons,2nd,62.0,3,849,48,NaN,1,31,Washington
8,Scouts,1st,NaN,4,973,48,NaN,0,2,Oregon
11,Scouts,2nd,35.0,9,1523,345,NaN,1,3,Georgia

### Step 3. Drop features, if there are more than 30% missing values.

In [266]:
len(army)*0.7

8.399999999999999

In [267]:
army.dropna(axis=1, thresh=len(army)*0.7, inplace=True)

In [268]:
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,origin
0,Nighthawks,1st,523.0,5,1045,1,1,4,Arizona
1,Nighthawks,1st,52.0,42,957,5,0,24,California
2,Nighthawks,2nd,25.0,2,1099,62,1,31,Texas
3,Nighthawks,2nd,616.0,2,1400,26,1,2,Florida
4,Dragoons,1st,43.0,4,1592,73,0,3,Maine
5,Dragoons,1st,234.0,7,1006,37,1,4,Iowa
6,Dragoons,2nd,523.0,8,987,949,0,24,Alaska
7,Dragoons,2nd,62.0,3,849,48,1,31,Washington
8,Scouts,1st,NaN,4,973,48,0,2,Oregon
9,Scouts,1st,73.0,7,1005,435,0,3,Wyoming
10,Scouts,2nd,37.0,8,1099,63,1,2,Louisana
11,Scouts,2nd,35.0,9,1523,345,1,3,Georgia

### Step 4. Fill missing values with the mean of their regiment.

In [269]:
medias_r = army.groupby("regiment")['deaths'].mean()
medias_r

regiment
Dragoons      215.500000
Nighthawks    304.000000
Scouts         48.333333
Name: deaths, dtype: float64

In [270]:
army['deaths_mean']= army.groupby("regiment")['deaths'].transform('mean')
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,origin,deaths_mean
0,Nighthawks,1st,523.0,5,1045,1,1,4,Arizona,304.000000
1,Nighthawks,1st,52.0,42,957,5,0,24,California,304.000000
2,Nighthawks,2nd,25.0,2,1099,62,1,31,Texas,304.000000
3,Nighthawks,2nd,616.0,2,1400,26,1,2,Florida,304.000000
4,Dragoons,1st,43.0,4,1592,73,0,3,Maine,215.500000
5,Dragoons,1st,234.0,7,1006,37,1,4,Iowa,215.500000
6,Dragoons,2nd,523.0,8,987,949,0,24,Alaska,215.500000
7,Dragoons,2nd,62.0,3,849,48,1,31,Washington,215.500000
8,Scouts,1st,NaN,4,973,48,0,2,Oregon,48.333333
9,Scouts,1st,73.0,7,1005,435,0,3,Wyoming,48.333333
10,Scouts,2nd,37.0,8,1099,63,1,2,Louisana,48.333333
11,Scouts,2nd,35.0,9,1523,345,1,3,Georgia,48.333333

In [271]:
army.loc[army['deaths'].isna(),'deaths']

8   NaN
Name: deaths, dtype: float64

In [272]:
army.loc[army['deaths'].isna(),'deaths_mean']

8    48.333333
Name: deaths_mean, dtype: float64

In [273]:
army.loc[army['deaths'].isna(),'deaths'] = army.loc[army['deaths'].isna(),'deaths_mean']
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,origin,deaths_mean
0,Nighthawks,1st,523.000000,5,1045,1,1,4,Arizona,304.000000
1,Nighthawks,1st,52.000000,42,957,5,0,24,California,304.000000
2,Nighthawks,2nd,25.000000,2,1099,62,1,31,Texas,304.000000
3,Nighthawks,2nd,616.000000,2,1400,26,1,2,Florida,304.000000
4,Dragoons,1st,43.000000,4,1592,73,0,3,Maine,215.500000
5,Dragoons,1st,234.000000,7,1006,37,1,4,Iowa,215.500000
6,Dragoons,2nd,523.000000,8,987,949,0,24,Alaska,215.500000
7,Dragoons,2nd,62.000000,3,849,48,1,31,Washington,215.500000
8,Scouts,1st,48.333333,4,973,48,0,2,Oregon,48.333333
9,Scouts,1st,73.000000,7,1005,435,0,3,Wyoming,48.333333
10,Scouts,2nd,37.000000,8,1099,63,1,2,Louisana,48.333333
11,Scouts,2nd,35.000000,9,1523,345,1,3,Georgia,48.333333

In [274]:
army[army['deaths'].isnull()]['regiment']

Series([], Name: regiment, dtype: object)

In [275]:
medias_r['Scouts']

np.float64(48.333333333333336)

In [276]:
army.loc[army['deaths'].isna(),'deaths'] = 48.3
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,origin,deaths_mean
0,Nighthawks,1st,523.000000,5,1045,1,1,4,Arizona,304.000000
1,Nighthawks,1st,52.000000,42,957,5,0,24,California,304.000000
2,Nighthawks,2nd,25.000000,2,1099,62,1,31,Texas,304.000000
3,Nighthawks,2nd,616.000000,2,1400,26,1,2,Florida,304.000000
4,Dragoons,1st,43.000000,4,1592,73,0,3,Maine,215.500000
5,Dragoons,1st,234.000000,7,1006,37,1,4,Iowa,215.500000
6,Dragoons,2nd,523.000000,8,987,949,0,24,Alaska,215.500000
7,Dragoons,2nd,62.000000,3,849,48,1,31,Washington,215.500000
8,Scouts,1st,48.333333,4,973,48,0,2,Oregon,48.333333
9,Scouts,1st,73.000000,7,1005,435,0,3,Wyoming,48.333333
10,Scouts,2nd,37.000000,8,1099,63,1,2,Louisana,48.333333
11,Scouts,2nd,35.000000,9,1523,345,1,3,Georgia,48.333333

In [277]:
army.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   regiment     12 non-null     object
 1   company      12 non-null     object
 2   deaths       12 non-null     float64
 3   battles      12 non-null     int64
 4   size         12 non-null     int64
 5   veterans     12 non-null     int64
 6   armored      12 non-null     int64
 7   deserters    12 non-null     int64
 8   origin       12 non-null     object
 9   deaths_mean  12 non-null     float64
dtypes: float64(2), int64(5), object(3)
memory usage: 1.1+ KB

In [278]:
army['deaths'].fillna(medias_r['Scouts'], inplace=True)

C:\Users\hegoi\AppData\Local\Temp\ipykernel_4140\811070036.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  army['deaths'].fillna(medias_r['Scouts'], inplace=True)

In [279]:
army['deaths'].fillna(medias_r['Scouts'], inplace=True)

C:\Users\hegoi\AppData\Local\Temp\ipykernel_4140\811070036.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  army['deaths'].fillna(medias_r['Scouts'], inplace=True)

In [280]:
# army['deaths'].fillna(army.groupby("regiment")['deaths'].mean()[army[army['deaths'].isnull()]['regiment'].values[0]], inplace=True)

In [281]:
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,origin,deaths_mean
0,Nighthawks,1st,523.000000,5,1045,1,1,4,Arizona,304.000000
1,Nighthawks,1st,52.000000,42,957,5,0,24,California,304.000000
2,Nighthawks,2nd,25.000000,2,1099,62,1,31,Texas,304.000000
3,Nighthawks,2nd,616.000000,2,1400,26,1,2,Florida,304.000000
4,Dragoons,1st,43.000000,4,1592,73,0,3,Maine,215.500000
5,Dragoons,1st,234.000000,7,1006,37,1,4,Iowa,215.500000
6,Dragoons,2nd,523.000000,8,987,949,0,24,Alaska,215.500000
7,Dragoons,2nd,62.000000,3,849,48,1,31,Washington,215.500000
8,Scouts,1st,48.333333,4,973,48,0,2,Oregon,48.333333
9,Scouts,1st,73.000000,7,1005,435,0,3,Wyoming,48.333333
10,Scouts,2nd,37.000000,8,1099,63,1,2,Louisana,48.333333
11,Scouts,2nd,35.000000,9,1523,345,1,3,Georgia,48.333333

### Step 5. Set the 'origin' colum as the index of the dataframe

In [282]:
army.set_index('origin', inplace=True)

In [283]:
army

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.000000,5,1045,1,1,4,304.000000
California,Nighthawks,1st,52.000000,42,957,5,0,24,304.000000
Texas,Nighthawks,2nd,25.000000,2,1099,62,1,31,304.000000
Florida,Nighthawks,2nd,616.000000,2,1400,26,1,2,304.000000
Maine,Dragoons,1st,43.000000,4,1592,73,0,3,215.500000
Iowa,Dragoons,1st,234.000000,7,1006,37,1,4,215.500000
Alaska,Dragoons,2nd,523.000000,8,987,949,0,24,215.500000
Washington,Dragoons,2nd,62.000000,3,849,48,1,31,215.500000
Oregon,Scouts,1st,48.333333,4,973,48,0,2,48.333333
Wyoming,Scouts,1st,73.000000,7,1005,435,0,3,48.333333
Louisana,Scouts,2nd,37.000000,8,1099,63,1,2,48.333333
Georgia,Scouts,2nd,35.000000,9,1523,345,1,3,48.333333

### Step 6. Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [284]:
army.loc[["Maine", "Alaska"], ['deaths', 'size', 'deserters']]

        deaths  size  deserters
origin
Maine     43.0  1592          3
Alaska   523.0   987         24

### Step 7. Select the rows 3 to 7 and the columns 3 to 6

In [285]:
army.iloc[2:7, 2:6]

         deaths  battles  size  veterans
origin
Texas      25.0        2  1099        62
Florida   616.0        2  1400        26
Maine      43.0        4  1592        73
Iowa      234.0        7  1006        37
Alaska    523.0        8   987       949

### Step 8. Select every row after the fourth row and all columns

In [286]:
army.iloc[4:, :]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Maine,Dragoons,1st,43.000000,4,1592,73,0,3,215.500000
Iowa,Dragoons,1st,234.000000,7,1006,37,1,4,215.500000
Alaska,Dragoons,2nd,523.000000,8,987,949,0,24,215.500000
Washington,Dragoons,2nd,62.000000,3,849,48,1,31,215.500000
Oregon,Scouts,1st,48.333333,4,973,48,0,2,48.333333
Wyoming,Scouts,1st,73.000000,7,1005,435,0,3,48.333333
Louisana,Scouts,2nd,37.000000,8,1099,63,1,2,48.333333
Georgia,Scouts,2nd,35.000000,9,1523,345,1,3,48.333333

### Step 9. Select every row up to the 4th row and all columns

In [287]:
army.iloc[:4, :]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1,4,304.0
California,Nighthawks,1st,52.0,42,957,5,0,24,304.0
Texas,Nighthawks,2nd,25.0,2,1099,62,1,31,304.0
Florida,Nighthawks,2nd,616.0,2,1400,26,1,2,304.0

### Step 10. Select the 3rd column up to the 7th column

In [288]:
army.iloc[:, 2:7]

                deaths  battles  size  veterans  armored
origin
Arizona     523.000000        5  1045         1        1
California   52.000000       42   957         5        0
Texas        25.000000        2  1099        62        1
Florida     616.000000        2  1400        26        1
Maine        43.000000        4  1592        73        0
Iowa        234.000000        7  1006        37        1
Alaska      523.000000        8   987       949        0
Washington   62.000000        3   849        48        1
Oregon       48.333333        4   973        48        0
Wyoming      73.000000        7  1005       435        0
Louisana     37.000000        8  1099        63        1
Georgia      35.000000        9  1523       345        1

### Step 11. Select rows where df.deaths is greater than 50

In [289]:
army[army['deaths'] > 50]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1,4,304.000000
California,Nighthawks,1st,52.0,42,957,5,0,24,304.000000
Florida,Nighthawks,2nd,616.0,2,1400,26,1,2,304.000000
Iowa,Dragoons,1st,234.0,7,1006,37,1,4,215.500000
Alaska,Dragoons,2nd,523.0,8,987,949,0,24,215.500000
Washington,Dragoons,2nd,62.0,3,849,48,1,31,215.500000
Wyoming,Scouts,1st,73.0,7,1005,435,0,3,48.333333

### Step 12. Select rows where df.deaths is greater than 500 or less than 50

In [290]:
army[(army['deaths'] > 500) |  (army['deaths'] < 50)]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.000000,5,1045,1,1,4,304.000000
Texas,Nighthawks,2nd,25.000000,2,1099,62,1,31,304.000000
Florida,Nighthawks,2nd,616.000000,2,1400,26,1,2,304.000000
Maine,Dragoons,1st,43.000000,4,1592,73,0,3,215.500000
Alaska,Dragoons,2nd,523.000000,8,987,949,0,24,215.500000
Oregon,Scouts,1st,48.333333,4,973,48,0,2,48.333333
Louisana,Scouts,2nd,37.000000,8,1099,63,1,2,48.333333
Georgia,Scouts,2nd,35.000000,9,1523,345,1,3,48.333333

### Step 13. Select all the regiments not named "Dragoons"

In [291]:
army[(army['regiment'] != "Dragoons")]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.000000,5,1045,1,1,4,304.000000
California,Nighthawks,1st,52.000000,42,957,5,0,24,304.000000
Texas,Nighthawks,2nd,25.000000,2,1099,62,1,31,304.000000
Florida,Nighthawks,2nd,616.000000,2,1400,26,1,2,304.000000
Oregon,Scouts,1st,48.333333,4,973,48,0,2,48.333333
Wyoming,Scouts,1st,73.000000,7,1005,435,0,3,48.333333
Louisana,Scouts,2nd,37.000000,8,1099,63,1,2,48.333333
Georgia,Scouts,2nd,35.000000,9,1523,345,1,3,48.333333

### Step 14. Select the rows called Texas and Arizona

In [292]:
army.loc[["Texas","Arizona"],:]

,regiment,company,deaths,battles,size,veterans,armored,deserters,deaths_mean
origin,,,,,,,,,
Texas,Nighthawks,2nd,25.0,2,1099,62,1,31,304.0
Arizona,Nighthawks,1st,523.0,5,1045,1,1,4,304.0

### Step 15. Select the third cell in the row named Arizona

In [293]:
army.loc["Arizona"][2]

C:\Users\hegoi\AppData\Local\Temp\ipykernel_4140\822538043.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  army.loc["Arizona"][2]

np.float64(523.0)

In [294]:
army.columns[2]

'deaths'

In [295]:
army.loc["Arizona"][army.columns[2]]

np.float64(523.0)

In [296]:
army.loc["Arizona",army.columns[2]]

np.float64(523.0)

### Step 16. Select the third cell down in the column named deaths

In [297]:
army['deaths'][-3]

C:\Users\hegoi\AppData\Local\Temp\ipykernel_4140\841397891.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  army['deaths'][-3]

np.float64(73.0)

In [298]:
army.index[-3]

'Wyoming'

In [299]:
army.loc[army.index[-3],"deaths"]

np.float64(73.0)

In [300]:
army.loc[army.index[-3]]['deaths']

np.float64(73.0)